In [1]:
import pandas as pd
import numpy as np

np.random.seed(42)
df = pd.DataFrame(np.random.randint(0, 5, size=(10, 1)), columns=['col0'])
df

   col0
0     3
1     4
2     2
3     4
4     4
5     1
6     2
7     2
8     2
9     4

In [5]:
df1 = df.assign(col1 = df.index)
df1.col1 = df1.col1.astype(str)
gp = df1.groupby('col0').sum()
gp = gp.assign(col1 = [list(i) for i  in gp.col1] )
gp

              col1
col0
1              [5]
2     [2, 6, 7, 8]
3              [0]
4     [1, 3, 4, 9]

In [7]:
result = pd.merge(df1['col0'],gp,how = 'left',left_on = 'col0',right_index = True)
result

   col0          col1
0     3           [0]
1     4  [1, 3, 4, 9]
2     2  [2, 6, 7, 8]
3     4  [1, 3, 4, 9]
4     4  [1, 3, 4, 9]
5     1           [5]
6     2  [2, 6, 7, 8]
7     2  [2, 6, 7, 8]
8     2  [2, 6, 7, 8]
9     4  [1, 3, 4, 9]

In [1]:
import pandas as pd
import numpy as np

np.random.seed(42)
df = pd.DataFrame(np.random.randint(0, 5, size=(10, 1)), columns=['col0'])
df

   col0
0     3
1     4
2     2
3     4
4     4
5     1
6     2
7     2
8     2
9     4

In [13]:
#gp = df.groupby('col0').apply(lambda x: x.index.to_list())         #groupby后apply会将gp变为series
ser = df.groupby('col0').apply(lambda x: x.index.to_list())         
ser

col0
1             [5]
2    [2, 6, 7, 8]
3             [0]
4    [1, 3, 4, 9]
dtype: object

In [15]:
ser = df.groupby('col0').apply(lambda x: x.index.to_list())         
ser

col0
1             [5]
2    [2, 6, 7, 8]
3             [0]
4    [1, 3, 4, 9]
dtype: object

In [16]:
result = df.col0.map(ser)
result

0             [0]
1    [1, 3, 4, 9]
2    [2, 6, 7, 8]
3    [1, 3, 4, 9]
4    [1, 3, 4, 9]
5             [5]
6    [2, 6, 7, 8]
7    [2, 6, 7, 8]
8    [2, 6, 7, 8]
9    [1, 3, 4, 9]
Name: col0, dtype: object